In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [21]:
students = pd.read_csv('../data/P87-S6-Merging-Resources/students.csv')
teachers =  pd.read_csv('../data/P87-S6-Merging-Resources/teachers.csv')
grades1 = pd.read_csv('../data/P87-S6-Merging-Resources/grades1.csv')
grades2 = pd.read_csv('../data/P87-S6-Merging-Resources/grades2.csv')
contact = pd.read_csv('../data/P87-S6-Merging-Resources/contact.csv')

In [22]:
print(students.head(2))
print('\n')
print(teachers.head(2))
print('\n')
print(grades1.head(2))
print('\n')
print(grades2.head(2))
print('\n')
print(contact.head(2))

      id firstname lastname
0  34292    Joshua    Davis
1  34293     Karen   Flores


    course        teacher
0  PHYS101   Wayne Walker
1  CHEM101  Albert Taylor


   student_id   course grade
0       34292  ENGL101     A
1       34293  ENGL101     A


   student_id   course grade
0       34302  DRAM101     F
1       34303  DRAM101     D


   student_id parent_contact           phone
0       34292   Samuel Davis  (356) 849-0352
1       34293   Laura Flores  (477) 325-7117

In [23]:
grades1["semester"] = 1
grades2["semester"] = 2
grades =pd.concat([grades1, grades2])
grades

    student_id   course grade  semester
0        34292  ENGL101     A         1
1        34293  ENGL101     A         1
2        34294  ENGL101     C         1
3        34295  ENGL101     C         1
4        34296  ENGL101     C         1
..         ...      ...   ...       ...
60       34312  DESN101     E         2
61       34313  DESN101     D         2
62       34314  DESN101     A         2
63       34315  DESN101     A         2
64       34316  DESN101     A         2

[190 rows x 4 columns]

##### We have to reset index since when we concatinate the data frames we will have DUPLICATED INDEX!

In [24]:
grades.reset_index(inplace=True, drop=True)
grades

     student_id   course grade  semester
0         34292  ENGL101     A         1
1         34293  ENGL101     A         1
2         34294  ENGL101     C         1
3         34295  ENGL101     C         1
4         34296  ENGL101     C         1
..          ...      ...   ...       ...
185       34312  DESN101     E         2
186       34313  DESN101     D         2
187       34314  DESN101     A         2
188       34315  DESN101     A         2
189       34316  DESN101     A         2

[190 rows x 4 columns]